---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisAdvancedOptions
source: html/25dc3d15-64b3-08aa-e4de-1c37196da687.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisAdvancedOptions Property

"Other Options"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisAdvancedOptions { get; }
```